benchmark/500k-large-groups/bitmap/wrk2/bitmap-t1-c1-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.125ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  537.52us   9.82ms   71.25%
    Req/Sec     2.11k   178.90     3.70k    69.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.34ms
 90.000%    1.70ms
 99.000%    2.28ms
 99.900%    5.43ms
 99.990%    8.93ms
 99.999%    9.82ms
100.000%    9.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.411     0.100000         4003         1.11
       0.592     0.200000         8008         1.25
       0.756     0.300000        12010         1.43
       0.899     0.400000        16005         1.67
       1.029     0.500000        20014         2.00
       1.090     0.550000        22016         2.22
       1.146     0.600000        24004         2.50
       1.206     0.650000        26008         2.86
       1.269     0.700000        28005         3.33
       1.340     0.750000        29998         4.00
       1.381     0.775000        31002         4.44
       1.424     0.800000        31999         5.00
       1.476     0.825000        33004         5.71
       1.540     0.850000        33994         6.67
       1.616     0.875000        35006         8.00
       1.659     0.887500        35496         8.89
       1.702     0.900000        36002        10.00
       1.744     0.912500        36495        11.43
       1.795     0.925000        36997        13.33
       1.842     0.937500        37494        16.00
       1.871     0.943750        37742        17.78
       1.905     0.950000        37994        20.00
       1.938     0.956250        38241        22.86
       1.970     0.962500        38496        26.67
       2.012     0.968750        38745        32.00
       2.035     0.971875        38875        35.56
       2.059     0.975000        38991        40.00
       2.087     0.978125        39120        45.71
       2.119     0.981250        39248        53.33
       2.153     0.984375        39368        64.00
       2.181     0.985938        39428        71.11
       2.209     0.987500        39491        80.00
       2.251     0.989062        39553        91.43
       2.297     0.990625        39619       106.67
       2.375     0.992188        39681       128.00
       2.421     0.992969        39709       142.22
       2.485     0.993750        39741       160.00
       2.597     0.994531        39772       182.86
       2.749     0.995313        39803       213.33
       2.951     0.996094        39834       256.00
       3.093     0.996484        39850       284.44
       3.253     0.996875        39866       320.00
       3.461     0.997266        39881       365.71
       3.749     0.997656        39897       426.67
       4.043     0.998047        39912       512.00
       4.231     0.998242        39921       568.89
       4.443     0.998437        39929       640.00
       4.711     0.998633        39936       731.43
       5.127     0.998828        39944       853.33
       5.463     0.999023        39951      1024.00
       5.579     0.999121        39955      1137.78
       5.843     0.999219        39959      1280.00
       6.323     0.999316        39963      1462.86
       6.571     0.999414        39967      1706.67
       7.323     0.999512        39971      2048.00
       7.723     0.999561        39973      2275.56
       7.855     0.999609        39975      2560.00
       8.023     0.999658        39977      2925.71
       8.095     0.999707        39979      3413.33
       8.167     0.999756        39981      4096.00
       8.439     0.999780        39982      4551.11
       8.463     0.999805        39983      5120.00
       8.671     0.999829        39984      5851.43
       8.823     0.999854        39985      6826.67
       8.927     0.999878        39986      8192.00
       8.927     0.999890        39986      9102.22
       9.111     0.999902        39987     10240.00
       9.111     0.999915        39987     11702.86
       9.143     0.999927        39988     13653.33
       9.143     0.999939        39988     16384.00
       9.143     0.999945        39988     18204.44
       9.543     0.999951        39989     20480.00
       9.543     0.999957        39989     23405.71
       9.543     0.999963        39989     27306.67
       9.543     0.999969        39989     32768.00
       9.543     0.999973        39989     36408.89
       9.823     0.999976        39990     40960.00
       9.823     1.000000        39990          inf
#[Mean    =        1.050, StdDeviation   =        0.538]
#[Max     =        9.816, Total count    =        39990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59996 requests in 30.00s, 11.67MB read
Requests/sec:   1999.96
Transfer/sec:    398.43KB