benchmark/500k-large-groups/bitmap/wrk2/bitmap-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.077ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  493.42us  10.38ms   69.90%
    Req/Sec     1.06k   120.79     1.90k    82.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.38ms
 90.000%    1.71ms
 99.000%    2.27ms
 99.900%    4.51ms
 99.990%    7.15ms
 99.999%   10.39ms
100.000%   10.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.083     0.000000            1         1.00
       0.509     0.100000         3990         1.11
       0.648     0.200000         8015         1.25
       0.765     0.300000        11995         1.43
       0.881     0.400000        15990         1.67
       1.006     0.500000        19954         2.00
       1.076     0.550000        21976         2.22
       1.143     0.600000        23947         2.50
       1.212     0.650000        25957         2.86
       1.289     0.700000        27942         3.33
       1.382     0.750000        29936         4.00
       1.431     0.775000        30932         4.44
       1.479     0.800000        31932         5.00
       1.528     0.825000        32938         5.71
       1.582     0.850000        33938         6.67
       1.641     0.875000        34927         8.00
       1.672     0.887500        35429         8.89
       1.706     0.900000        35915        10.00
       1.742     0.912500        36428        11.43
       1.784     0.925000        36917        13.33
       1.835     0.937500        37415        16.00
       1.863     0.943750        37661        17.78
       1.894     0.950000        37912        20.00
       1.931     0.956250        38163        22.86
       1.966     0.962500        38405        26.67
       2.008     0.968750        38654        32.00
       2.035     0.971875        38779        35.56
       2.067     0.975000        38905        40.00
       2.097     0.978125        39028        45.71
       2.135     0.981250        39153        53.33
       2.175     0.984375        39279        64.00
       2.193     0.985938        39345        71.11
       2.221     0.987500        39404        80.00
       2.247     0.989062        39465        91.43
       2.289     0.990625        39526       106.67
       2.339     0.992188        39589       128.00
       2.361     0.992969        39620       142.22
       2.387     0.993750        39651       160.00
       2.435     0.994531        39684       182.86
       2.465     0.995313        39713       213.33
       2.511     0.996094        39746       256.00
       2.535     0.996484        39761       284.44
       2.571     0.996875        39776       320.00
       2.615     0.997266        39791       365.71
       2.697     0.997656        39807       426.67
       2.883     0.998047        39823       512.00
       2.943     0.998242        39830       568.89
       3.065     0.998437        39838       640.00
       3.513     0.998633        39846       731.43
       4.191     0.998828        39854       853.33
       4.619     0.999023        39862      1024.00
       4.751     0.999121        39865      1137.78
       4.891     0.999219        39869      1280.00
       5.055     0.999316        39873      1462.86
       5.227     0.999414        39877      1706.67
       5.539     0.999512        39881      2048.00
       5.699     0.999561        39883      2275.56
       5.883     0.999609        39885      2560.00
       6.139     0.999658        39887      2925.71
       6.539     0.999707        39889      3413.33
       6.811     0.999756        39891      4096.00
       6.955     0.999780        39892      4551.11
       6.971     0.999805        39893      5120.00
       7.087     0.999829        39894      5851.43
       7.115     0.999854        39895      6826.67
       7.151     0.999878        39896      8192.00
       7.151     0.999890        39896      9102.22
       9.567     0.999902        39897     10240.00
       9.567     0.999915        39897     11702.86
       9.951     0.999927        39898     13653.33
       9.951     0.999939        39898     16384.00
       9.951     0.999945        39898     18204.44
      10.007     0.999951        39899     20480.00
      10.007     0.999957        39899     23405.71
      10.007     0.999963        39899     27306.67
      10.007     0.999969        39899     32768.00
      10.007     0.999973        39899     36408.89
      10.391     0.999976        39900     40960.00
      10.391     1.000000        39900          inf
#[Mean    =        1.070, StdDeviation   =        0.493]
#[Max     =       10.384, Total count    =        39900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59962 requests in 30.00s, 11.67MB read
Requests/sec:   1998.68
Transfer/sec:    398.18KB