benchmark/500k-large-groups/bitmap/wrk2/bitmap-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.185ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.070ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  487.48us   6.89ms   68.50%
    Req/Sec     1.05k   120.56     2.00k    81.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.06ms
 75.000%    1.42ms
 90.000%    1.77ms
 99.000%    2.41ms
 99.900%    3.21ms
 99.990%    6.32ms
 99.999%    6.89ms
100.000%    6.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.072     0.000000            1         1.00
       0.534     0.100000         4007         1.11
       0.694     0.200000         7999         1.25
       0.821     0.300000        11988         1.43
       0.940     0.400000        15960         1.67
       1.062     0.500000        19980         2.00
       1.125     0.550000        21959         2.22
       1.190     0.600000        23944         2.50
       1.265     0.650000        25954         2.86
       1.341     0.700000        27947         3.33
       1.423     0.750000        29937         4.00
       1.466     0.775000        30931         4.44
       1.515     0.800000        31934         5.00
       1.567     0.825000        32921         5.71
       1.627     0.850000        33933         6.67
       1.691     0.875000        34932         8.00
       1.729     0.887500        35429         8.89
       1.770     0.900000        35913        10.00
       1.813     0.912500        36419        11.43
       1.861     0.925000        36917        13.33
       1.917     0.937500        37407        16.00
       1.950     0.943750        37657        17.78
       1.987     0.950000        37907        20.00
       2.027     0.956250        38159        22.86
       2.067     0.962500        38404        26.67
       2.115     0.968750        38663        32.00
       2.141     0.971875        38782        35.56
       2.171     0.975000        38905        40.00
       2.209     0.978125        39033        45.71
       2.249     0.981250        39152        53.33
       2.307     0.984375        39279        64.00
       2.333     0.985938        39342        71.11
       2.363     0.987500        39403        80.00
       2.393     0.989062        39465        91.43
       2.431     0.990625        39528       106.67
       2.475     0.992188        39589       128.00
       2.497     0.992969        39623       142.22
       2.527     0.993750        39652       160.00
       2.561     0.994531        39683       182.86
       2.599     0.995313        39715       213.33
       2.649     0.996094        39745       256.00
       2.691     0.996484        39760       284.44
       2.755     0.996875        39776       320.00
       2.789     0.997266        39791       365.71
       2.855     0.997656        39807       426.67
       2.935     0.998047        39823       512.00
       3.009     0.998242        39830       568.89
       3.065     0.998437        39838       640.00
       3.109     0.998633        39846       731.43
       3.163     0.998828        39854       853.33
       3.239     0.999023        39862      1024.00
       3.253     0.999121        39865      1137.78
       3.301     0.999219        39869      1280.00
       3.363     0.999316        39873      1462.86
       3.413     0.999414        39877      1706.67
       3.491     0.999512        39881      2048.00
       3.529     0.999561        39883      2275.56
       3.539     0.999609        39885      2560.00
       3.643     0.999658        39887      2925.71
       3.651     0.999707        39889      3413.33
       4.057     0.999756        39891      4096.00
       4.119     0.999780        39892      4551.11
       4.415     0.999805        39893      5120.00
       4.619     0.999829        39894      5851.43
       4.847     0.999854        39895      6826.67
       6.315     0.999878        39896      8192.00
       6.315     0.999890        39896      9102.22
       6.479     0.999902        39897     10240.00
       6.479     0.999915        39897     11702.86
       6.539     0.999927        39898     13653.33
       6.539     0.999939        39898     16384.00
       6.539     0.999945        39898     18204.44
       6.823     0.999951        39899     20480.00
       6.823     0.999957        39899     23405.71
       6.823     0.999963        39899     27306.67
       6.823     0.999969        39899     32768.00
       6.823     0.999973        39899     36408.89
       6.895     0.999976        39900     40960.00
       6.895     1.000000        39900          inf
#[Mean    =        1.118, StdDeviation   =        0.487]
#[Max     =        6.892, Total count    =        39900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59962 requests in 30.00s, 11.67MB read
Requests/sec:   1998.65
Transfer/sec:    398.17KB